### Import

In [1]:
import pandas as pd
import numpy as np 

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan data frame

In [2]:
n_rows = 5
n_cols = 2
cols = ['omset','operasional']

df = pd.DataFrame(np.random.randint(1,20, size=(n_rows,n_cols)),
                 columns=cols)
df

   omset  operasional
0     17           19
1      9            5
2     19           18
3      4            4
4      4            2

In [3]:
df['omset'] = df['omset'] * 100_000
df['operasional'] = df['operasional'] * 10_000
df

     omset  operasional
0  1700000       190000
1   900000        50000
2  1900000       180000
3   400000        40000
4   400000        20000

In [4]:
df.index = pd.util.testing.makeDateIndex(n_rows,freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

C:\Users\Michelle\anaconda3\lib\site-packages\pandas\util\__init__.py:15: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

     tanggal    omset  operasional
0 2000-01-01  1700000       190000
1 2000-01-02   900000        50000
2 2000-01-03  1900000       180000
3 2000-01-04   400000        40000
4 2000-01-05   400000        20000

In [5]:
## df.index = pd.util.testing.makeDateIndex(n_rows,freq='D') --> D adalah daily

### Melakukan formatting tampilan data frame

In [6]:
formatku = {'tanggal':'{:%d/%m/%y}',
           'operasional':'Rp {:.2f}',
           'omset':'Rp {:.2f}'}

laporan = df.style.format(formatku)
laporan

In [ ]:
## 'operasional':'Rp {:.2f}',
## 'omset':'Rp {:.2f}'} --> .2f artinya ada koma dibelakangnya

In [7]:
type(laporan)

pandas.io.formats.style.Styler

In [8]:
laporan.hide_index()

In [9]:
laporan.set_caption('Data Omset dan Operasional')

In [10]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')